algo/hw5/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<!-- 2016-10-27 Thu 16:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Daniel Dyla" />
</head>
<body>
<div id="content">
<h1 class="title">index</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Sorting functions</a>
<ul>
<li><a href="#sec-1-1">1.1. Insertion Sort</a></li>
<li><a href="#sec-1-2">1.2. Quicksort</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Speed Analysis</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Sorting functions</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Insertion Sort</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-c">void iisort(int *a, int n) 
{
  int i, j, t;
  for (i = 1; i &lt; n; i++)
    {
      for (j = i; j &gt; 0 &amp;&amp; a[j-1] &gt; a[j]; j--) 
	{
	  // inline swap
	  t = a[j-1]; a[j-1] = a[j]; a[j] = t;
	  // function swap
	  // swap(j, j-1, a);
	}
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Quicksort</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-c">void iqsort(int *a, int n)
{
  int i, j, t;
  if (n &lt;= 1) return;
  for(i=1,j=0;i&lt;n;i++)
    if (a[i] &lt; a[0])
      {
	// swap(++j, i, a);
	j++;
	t = a[j]; a[j] = a[i]; a[i] = t;
      }
  // swap(j, 0, a);
  t = a[j]; a[j] = a[0]; a[0] = t;
  iqsort(a, j);
  iqsort(a+j+1, n-j-1);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Speed Analysis</h2>
<div class="outline-text-2" id="text-2">
<p>
Table columns represent methods of generating an array. Row groups
represent different swapping methods. Rows represent measured values
after profiling the sorting functions. The time differences are
measured in microseconds.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">inline swaps</th>
<th scope="col" class="left">mod50000</th>
<th scope="col" class="right">mod5</th>
<th scope="col" class="right">mod2</th>
<th scope="col" class="right">desc</th>
<th scope="col" class="left">asc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">T(i) &lt; T(q)</td>
<td class="left">n &lt; 12</td>
<td class="right">n &lt; 20</td>
<td class="right">n &lt; 115; 180 &lt; n &lt; 310</td>
<td class="right">n &lt; 9</td>
<td class="left">all n</td>
</tr>

<tr>
<td class="left">n at peak diff</td>
<td class="left">8,9</td>
<td class="right">15,16</td>
<td class="right">280</td>
<td class="right">7</td>
<td class="left">0 &lt;&lt; n</td>
</tr>

<tr>
<td class="left">peak time diff</td>
<td class="left">0.07</td>
<td class="right">0.18</td>
<td class="right">30.79</td>
<td class="right">0.03</td>
<td class="left">N/A</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">function swaps</td>
<td class="left">mod50000</td>
<td class="right">mod5</td>
<td class="right">mod2</td>
<td class="right">desc</td>
<td class="left">asc</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">T(i) &lt; T(q)</td>
<td class="left">never</td>
<td class="right">12</td>
<td class="right">n &lt; 66</td>
<td class="right">n &lt; 7</td>
<td class="left">all n</td>
</tr>

<tr>
<td class="left">n at peak diff</td>
<td class="left">N/A</td>
<td class="right">8</td>
<td class="right">65</td>
<td class="right">3</td>
<td class="left">0 &lt;&lt; n</td>
</tr>

<tr>
<td class="left">peak time diff</td>
<td class="left">N/A</td>
<td class="right">0.17</td>
<td class="right">0.35</td>
<td class="right">0.02</td>
<td class="left">N/A</td>
</tr>
</tbody>
</table>


<p>
Based on this analysis it is my conclusion that even the most naive
quicksort beats an insertion sort by a healthy margin for almost all
classes of inputs other than very small arrays. Those small arrays are
larger as the input becomes less random and has more repeated
elements. Further, when a swap is more costly (as in the case of a
function call rather than inline code), the quicksort function gains a
larger advantage than the inline sort. In the special case of a sorted
or mostly sorted array, the inline sort is always faster than
qsort. It is possible that a smarter partitioning scheme for the
quicksort could have improved its standing against the inline sort.
</p>

<p>
It is also worth noting that the stdlib qsort (originally proposed in
Engineering a Sort Function by Bentley and McIlroy) is actually slower
than even the naive qsort used for this paper for arrays of random
integers, though it is constrained by the assumptions of a library
sort that this quicksort is not. Namely, it has to handle all cases
at least reasonably well and cannot afford to overly optimize for
specific cases. This just showcases the tradeoffs that must be made
for a library sort. The moral of the story is never to stop
questioning your tools.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Dyla</p>
<p class="date">Created: 2016-10-27 Thu 16:43</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
